In [45]:
import pandas as pd

df = pd.read_csv('table_2.csv')

df.head()

,Unnamed: 0,Name ▲,Translation,ISO Alpha-2 ▲▼,ISO Alpha-3/5 ▲▼,Speakers worldwide ▲▼,Countries where it is spoken,Additional language information
0,NaN,Name ▲,Translation,ISO Alpha-2 ▲▼,ISO Alpha-3/5 ▲▼,Speakers worldwide ▲▼,Countries where it is spoken,Additional language information
1,NaN,Name Abadi,Translation Translate a few words in Abadi,ISO Alpha-2 zzzNo data,ISO Alpha-3/5 kbt,Speakers worldwide 2900,Countries where it is spoken Papua New Guinea,Additional language information wikipedia
2,NaN,Name Abar,Translation Translate a few words in Abar,ISO Alpha-2 zzzNo data,ISO Alpha-3/5 mij,Speakers worldwide 1900,Countries where it is spoken Cameroon,Additional language information wikipedia
3,NaN,Name Abkhazian,Translation Translate a few words in Abkhazian,ISO Alpha-2 ab,ISO Alpha-3/5 abk,Speakers worldwide 113000,Countries where it is spoken Georgia Jordan S...,Additional language information wikipedia
4,NaN,Name Abun,Translation Translate a few words in Abun,ISO Alpha-2 zzzNo data,ISO Alpha-3/5 kgr,Speakers worldwide 3000,Countries where it is spoken Indonesia,Additional language information wikipedia

In [46]:
df.columns

Index(['Unnamed: 0', 'Name ▲', 'Translation', 'ISO Alpha-2 ▲▼',
       'ISO Alpha-3/5 ▲▼', 'Speakers worldwide ▲▼',
       'Countries where it is spoken', 'Additional language information'],
      dtype='object')

In [47]:
df = df[['ISO Alpha-3/5 ▲▼','Name ▲','Speakers worldwide ▲▼']]

In [48]:
df.head()

    ISO Alpha-3/5 ▲▼          Name ▲      Speakers worldwide ▲▼
0   ISO Alpha-3/5 ▲▼          Name ▲      Speakers worldwide ▲▼
1  ISO Alpha-3/5 kbt      Name Abadi    Speakers worldwide 2900
2  ISO Alpha-3/5 mij       Name Abar    Speakers worldwide 1900
3  ISO Alpha-3/5 abk  Name Abkhazian  Speakers worldwide 113000
4  ISO Alpha-3/5 kgr       Name Abun    Speakers worldwide 3000

In [49]:
df.columns = df.columns.str.replace(r'▲▼|▲|▼', '', regex=True)
df = df.replace(r'▲▼|▲|▼', '', regex=True)

In [50]:
df.head()

      ISO Alpha-3/5            Name         Speakers worldwide
0     ISO Alpha-3/5            Name         Speakers worldwide
1  ISO Alpha-3/5 kbt      Name Abadi    Speakers worldwide 2900
2  ISO Alpha-3/5 mij       Name Abar    Speakers worldwide 1900
3  ISO Alpha-3/5 abk  Name Abkhazian  Speakers worldwide 113000
4  ISO Alpha-3/5 kgr       Name Abun    Speakers worldwide 3000

In [51]:
df = df[1:]

In [52]:
df.head()

      ISO Alpha-3/5            Name         Speakers worldwide
1  ISO Alpha-3/5 kbt      Name Abadi    Speakers worldwide 2900
2  ISO Alpha-3/5 mij       Name Abar    Speakers worldwide 1900
3  ISO Alpha-3/5 abk  Name Abkhazian  Speakers worldwide 113000
4  ISO Alpha-3/5 kgr       Name Abun    Speakers worldwide 3000
5  ISO Alpha-3/5 mgj    Name Abureni    Speakers worldwide 4000

In [53]:
for col in df.columns:
    df[col] = df[col].str.replace(f'^{col}\\s*', '', regex=True)

In [54]:
df.head()

  ISO Alpha-3/5       Name  Speakers worldwide
1            kbt      Abadi                2900
2            mij       Abar                1900
3            abk  Abkhazian              113000
4            kgr       Abun                3000
5            mgj    Abureni                4000

In [55]:
print(df)

     ISO Alpha-3/5             Name  Speakers worldwide
1               kbt            Abadi                2900
2               mij             Abar                1900
3               abk        Abkhazian              113000
4               kgr             Abun                3000
5               mgj          Abureni                4000
...             ...              ...                 ...
6415            zuy           Zumaya             No data
6416            jmb           Zumbun                2000
6417            zun             Zuni                9700
6418            zzj  Zuojiang Zhuang             1800000
6419            zyp       Zyphe Chin               20000

[6419 rows x 3 columns]

In [57]:
df['Name '][9]

'Adamawa Fulfulde'

In [58]:
df.columns = df.columns.str.strip()

# Verify changes
print(df.columns)

Index(['ISO Alpha-3/5', 'Name', 'Speakers worldwide'], dtype='object')

In [59]:
df.to_csv('language_speakers_data.csv', index=False)